## Data Loading, Storage

In [1]:
import pandas as pd

In [2]:
mydata = {'Name':['Ali', 'Sara', 'Taha', 'Omid'],
         'Age':[27, 24, 25, 26],
         'Score':[19, 18, 20, 13]}

In [3]:
mydf = pd.DataFrame(mydata)
mydf

   Name  Age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

## CSV: Comma Seprated Values

In [4]:
mydf.to_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/Score.csv', index=False)

In [5]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/Score.csv')

   Name  Age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

## File without header

In [6]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/student.csv', header=None)

       0   1   2   3
0    Ali  12  20  18
1   Sara  13  14   6
2   Taha  12   8  19
3  Mahsa  20  16   9

In [7]:
# if you don't header
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/student.csv')

     Ali  12  20  18
0   Sara  13  14   6
1   Taha  12   8  19
2  Mahsa  20  16   9

In [8]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/student.csv', names=['Name', 'Python', 'C++', 'Java'])

    Name  Python  C++  Java
0    Ali      12   20    18
1   Sara      13   14     6
2   Taha      12    8    19
3  Mahsa      20   16     9

## Skiprows

In [9]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/age.csv')

  #  Hello shirafkan
0     name       age
1      Ali        12
2     Sara        13
3     Taha        12
4    Mahsa        20

In [10]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/age.csv', skiprows=[0])

    name  age
0    Ali   12
1   Sara   13
2   Taha   12
3  Mahsa   20

In [11]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/age.csv', header=[0,1])

  #  Hello shirafkan
      name       age
0      Ali        12
1     Sara        13
2     Taha        12
3    Mahsa        20

In [12]:
pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/age.csv', header=[1])

    name  age
0    Ali   12
1   Sara   13
2   Taha   12
3  Mahsa   20

## csv reader

In [13]:
import csv

In [14]:
with open('C:/Users/Hossein Molhem/frdrs/S04/Files/student.csv') as f:
    x = list(csv.reader(f))
x

[['Ali', '12', '20', '18'],
 ['Sara', '13', '14', '6'],
 ['Taha', '12', '8', '19'],
 ['Mahsa', '20', '16', '9']]

In [15]:
x

[['Ali', '12', '20', '18'],
 ['Sara', '13', '14', '6'],
 ['Taha', '12', '8', '19'],
 ['Mahsa', '20', '16', '9']]

In [16]:
x[0]

['Ali', '12', '20', '18']

## read_table

In [17]:
pd.read_table('C:/Users/Hossein Molhem/frdrs/S04/Files/score.csv')

  Name,Age,Score
0      Ali,27,19
1     Sara,24,18
2     Taha,25,20
3     Omid,26,13

In [18]:
pd.read_table('C:/Users/Hossein Molhem/frdrs/S04/Files/score.csv',sep=',')

   Name  Age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

In [19]:
pd.read_table('C:/Users/Hossein Molhem/frdrs/S04/Files/mytext.txt',sep='\s+')

      A  B  C
row1  1  2  3
row2  4  5  6

## nrows, chunksize

In [20]:
path = 'C:/Users/Hossein Molhem/frdrs/S04/Files/Alphabet.csv'

In [21]:
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
2     C     3
3     D     4
4     E     5
5     F     6
6     G     7
7     H     8
8     I     9
9     J    10
10    K    11
11    L    12
12    M    13
13    N    14
14    O    15
15    P    16
16    Q    17
17    R    18
18    S    19
19    T    20
20    U    21
21    V    22
22    W    23
23    X    24
24    Y    25
25    Z    26

In [22]:
pd.read_csv(path, nrows=4)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

In [23]:
pd.read_csv(path, nrows=8)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
4    E     5
5    F     6
6    G     7
7    H     8

In [24]:
pd.options.display.max_rows = 8
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
2     C     3
3     D     4
..  ...   ...
22    W    23
23    X    24
24    Y    25
25    Z    26

[26 rows x 2 columns]

In [25]:
pd.options.display.max_rows = 4
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
..  ...   ...
24    Y    25
25    Z    26

[26 rows x 2 columns]

In [26]:
pd.read_csv(path, skipfooter=22, engine='python')

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

In [27]:
pd.read_csv(path, skipfooter=22)

C:\Users\Hossein Molhem\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4

In [28]:
c = pd.read_csv(path, chunksize=4)
for i in c:
    print(i)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
  col1  col2
4    E     5
5    F     6
6    G     7
7    H     8
   col1  col2
8     I     9
9     J    10
10    K    11
11    L    12
   col1  col2
12    M    13
13    N    14
14    O    15
15    P    16
   col1  col2
16    Q    17
17    R    18
18    S    19
19    T    20
   col1  col2
20    U    21
21    V    22
22    W    23
23    X    24
   col1  col2
24    Y    25
25    Z    26

## sys.stdout

In [29]:
import sys

In [30]:
mydata = pd.read_csv('C:/Users/Hossein Molhem/frdrs/S04/Files/score.csv')

In [31]:
# dispaly data on monitor
mydata.to_csv(sys.stdout)

,Name,Age,Score
0,Ali,27,19
1,Sara,24,18
2,Taha,25,20
3,Omid,26,13

In [32]:
mydata.to_csv(sys.stdout, index=False, sep='|')

Name|Age|Score
Ali|27|19
Sara|24|18
Taha|25|20
Omid|26|13